# AreaBasedLoadBoundaryLineData Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AreaBasedLoadBoundaryLineData Methods
AreaBasedLoadBoundaryLineData Class See Also
---
The AreaBasedLoadBoundaryLineData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetLevelIdsInRange | Returns level ids between the top level and the bottom level (including the top level and the bottom level) of the area based load boundary line. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsElevationWithinRange | Checks whether the given elevation is between the bottom level and the top level(including the bottom level and the top level) of the area based load boundary line. |
| IsLevelWithinRange | Checks whether the given level is between the bottom level and the top level (including the bottom level and the top level) of the area based load boundary line. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
AreaBasedLoadBoundaryLineData Class
Autodesk.Revit.DB.Electrical Namespace